// Завдання 6
// Напиши скрипт з наступним функціоналом:
// При завантаженні сторінки користувачеві пропонується в prompt ввести число. Введення зберігається в змінну input і додається в масив чисел numbers.
// Операція введення числа користувачем і збереження в масив триває до тих пор, пір, поки користувач не натисне Cancel в prompt.
// Після того як користувач припинив введення натиснувши Cancel, якщо масив не порожній, необхідно порахувати суму всіх елементів масиву і записати її в змінну total. Використовуй цикл for або for...of. Після чого в консоль виведи рядок 'Загальна сума чисел дорівнює [сума]'.

let input;
const numbers = [];
let total = 0;

while (true) {
  input = prompt("Введіть число (або натисніть Cancel для завершення):");

  if (input === null) { //перевіряє чи натиснув користувач "cancel"
    break; // Користувач натиснув Cancel
  }

  const number = Number(input);

  if (isNaN(number)) {   //перевіря чи введене значення не є числом
    alert("Було введено не число, спробуйте ще раз");
    continue;
  }

  numbers.push(number); // додає число
}

if (numbers.length > 0) {
  for (const num of numbers) { // перебирає всі числа та додає до total
    total += num;
  }

  console.log(`Загальна сума чисел дорівнює ${total}`);
} else {
  console.log("Масив був порожній. Немає що підсумовувати.");
}